In [2]:
#configure jupyter notebook to run SQL commands
%load_ext sql

In [3]:
#connect to database
#database is a sqlite database file stored locally, 
#it is a open source db, refer to README for download location
%sql sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite

'Connected: @/Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite'

**Basic JOIN syntax**

In [4]:
%%sql result <<
SELECT t.Name AS track_name,
g.Name AS genre_name
FROM Track t
JOIN Genre g
ON t.GenreId = g.GenreId
LIMIT 5;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [5]:
result

[('For Those About To Rock (We Salute You)', 'Rock'),
 ('Balls to the Wall', 'Rock'),
 ('Fast As a Shark', 'Rock'),
 ('Restless and Wild', 'Rock'),
 ('Princess of the Dawn', 'Rock')]

## INNER JOIN

In [6]:
%%sql result <<
SELECT * FROM Album
LIMIT 5;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [7]:
result

[(1, 'For Those About To Rock We Salute You', 1),
 (2, 'Balls to the Wall', 2),
 (3, 'Restless and Wild', 2),
 (4, 'Let There Be Rock', 1),
 (5, 'Big Ones', 3)]

In [8]:
%%sql result <<
SELECT * FROM Artist
LIMIT 5;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [9]:
result

[(1, 'AC/DC'),
 (2, 'Accept'),
 (3, 'Aerosmith'),
 (4, 'Alanis Morissette'),
 (5, 'Alice In Chains')]

In [10]:
%%sql result <<
SELECT Album.AlbumId, Album.Title,  
Artist.ArtistId, Artist.Name
FROM Album
JOIN Artist
USING (ArtistId)
LIMIT 5;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [11]:
result

[(1, 'For Those About To Rock We Salute You', 1, 'AC/DC'),
 (2, 'Balls to the Wall', 2, 'Accept'),
 (3, 'Restless and Wild', 2, 'Accept'),
 (4, 'Let There Be Rock', 1, 'AC/DC'),
 (5, 'Big Ones', 3, 'Aerosmith')]

## OUTER JOINS

**LEFT JOIN**

In [12]:
%%sql result <<
SELECT a.name, a.composer, b.InvoiceLineId
FROM Track a
LEFT JOIN InvoiceLine b
ON a.TrackId = b.TrackId
LIMIT 8;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [13]:
result

[('For Those About To Rock (We Salute You)', 'Angus Young, Malcolm Young, Brian Johnson', 579),
 ('Balls to the Wall', None, 1),
 ('Balls to the Wall', None, 1154),
 ('Fast As a Shark', 'F. Baltes, S. Kaufman, U. Dirkscneider & W. Hoffman', 1728),
 ('Restless and Wild', 'F. Baltes, R.A. Smith-Diesel, S. Kaufman, U. Dirkscneider & W. Hoffman', 2),
 ('Princess of the Dawn', 'Deaffy & R.A. Smith-Diesel', 580),
 ('Put The Finger On You', 'Angus Young, Malcolm Young, Brian Johnson', 3),
 ("Let's Get It Up", 'Angus Young, Malcolm Young, Brian Johnson', None)]

**FULL OUTER JOIN**

In [22]:
%%sql result <<
SELECT *
FROM Invoice a
LEFT JOIN InvoiceLine b
ON a.InvoiceId = b.InvoiceId
UNION
SELECT * 
FROM InvoiceLine a
LEFT JOIN Invoice b
ON a.InvoiceId = b.InvoiceId
WHERE a.InvoiceId IS NULL
LIMIT 10;

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [23]:
result

[(1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98, 1, 1, 2, 0.99, 1),
 (1, 2, '2009-01-01 00:00:00', 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', 1.98, 2, 1, 4, 0.99, 1),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96, 3, 2, 6, 0.99, 1),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96, 4, 2, 8, 0.99, 1),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96, 5, 2, 10, 0.99, 1),
 (2, 4, '2009-01-02 00:00:00', 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', 3.96, 6, 2, 12, 0.99, 1),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94, 7, 3, 16, 0.99, 1),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94, 8, 3, 20, 0.99, 1),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94, 9, 3, 24, 0.99, 1),
 (3, 8, '2009-01-03 00:00:00', 'Grétrystraat 63', 'Brussels', None, 'Belgium', '1000', 5.94, 10, 3, 28, 0.99, 1)]

## Self JOIN

In [32]:
%%sql result <<
SELECT a.FirstName || ' ' || a.LastName AS employee,
b.FirstName || ' ' || b.LastName AS supervisor
FROM Employee a
JOIN Employee b
ON a.ReportsTo = b.EmployeeId

 * sqlite:////Users/admin/personal_projs/sql_practice/data/Chinook_Sqlite.sqlite
Done.
Returning data to local variable result

In [33]:
result

[('Nancy Edwards', 'Andrew Adams'),
 ('Jane Peacock', 'Nancy Edwards'),
 ('Margaret Park', 'Nancy Edwards'),
 ('Steve Johnson', 'Nancy Edwards'),
 ('Michael Mitchell', 'Andrew Adams'),
 ('Robert King', 'Michael Mitchell'),
 ('Laura Callahan', 'Michael Mitchell')]